{
	"title":"Aubergine parmigiana",
	"ingredients": [

"4 aubergines",
"flour for dusting the eggplant",
"seed oil for frying",
"500 ml of tomato purée",
"extra virgin olive oil",
"1 clove of garlic",
"a few basil leaves",
"150 g mozzarella fiordilatte, finely chopped",
"3 eggs, beaten",
"100 g of grated Parmesan cheese"

	],
	"directions": [

"Wash the aubergine and cut them into 5 mm thick slices.",
"Arrange the aubergine slices in a colander with a good sprinkle of coarse salt in between the layers, put a plate on top of the aubergines then place a weight over the plate. Leave the aubergines on the sink for about 30 minutes, they will be less bitter and biting.",
"After this time, rinse all your slices under running water and arrange them on a towel. Pat them dry.",
"Scoop some flour into a bowl and coat the aubergine slices, shaking off the excess flour from each slice.",
"Meanwhile heat the frying oil in a large pan: the best ones are those shaped like a wok: you will use less frying oil.",
"Check if the oil is hot enough sacrificing a slice of aubergine: dip a corner in the oil and when it is surrounded by many small small bubbles it means that the oil is hot enough.",
"Deep fry the aubergines in batches. Let them brown on both sides, it takes about 5 minutes. When the aubergines are golden and crisp, place them in a dish with some layer of kitchen paper, so that the excess oil is absorbed. Season lightly the aubergines with salt (lightly! they have already been under salt for 30 minutes! believe me when I say it's better to taste them to see how much salt they need, it is not much of a sacrifice). Deep fry all the aubergines.",
"Make the tomato sauce. Heat a few tablespoons of extra virgin olive oil in a pan with a clove of garlic. When the garlic turns golden pour the tomato purée, add a cup of water and some fresh basil leaves. Season with a pinch of salt. Cook the tomato purée for about ten minutes, until it has lost the taste of raw tomatoes and has become a savory and thick sauce.",
"Finally time has come to make the melanzane alla parmigiana. Choose your favourite baking dish (about 30 x 20 cm) and spread a few tablespoons of tomato sauce on the bottom.",
"Arrange a layer of fried aubergines, pour over a part of the beaten eggs, sprinkle with some mozzarella and a generous layer of grated Parmigiano. Spread the tomato sauce on top and keep making layers, until you run out of ingredients. If you have not eaten too many fried aubergine slices - you have my sympathy - you should be able to make four layers. Top with tomato sauce, a few pieces of mozzarella and a lot of Parmigiano.",
"Bake in the preheated oven to 180°C for about 35 minutes, until golden brown on the top.",
"Serve the parmigiana warm or, even better, let it cool down completely and warm it again in the evening or the next day, it will be even more tasty."
	
	]
}